{
    "rasgulla": [
        "Step 1 : Mic cheena snd kead until smooth.",
        "Step 2 : Make small balls from the dough. ",
        "Step 3 : Boil water with sugar to make syrup.",
        "Step 4 : Drop balls in syrup and cook until they double in size,",
        "Step 5 : Let them cool and serve chilled."
    ],
    "pancakes": [
        "Step 1 : Mix flour milk and eggs.",
        "Step 2 : Heat a pan over a medium heat.",
        "Step 3 : Pour batter onto the pan.",
        "Step 4 : Cook until bubbles form, then flip.",
        "Step 5 : Cook the other side until golden."
    ],
    "biryani": [
        "Grind the cashew, poppy seeds and cumin seeds into a smooth paste, using as little water as possible",
        "Set aside",
        "\r\n\r\nDeep fry the sliced onions when it is hot",
        "Don’t overcrowd the oil",
        "When the onions turn light brown, remove from oil and drain on paper towel",
        "The fried onion will crisp up as it drains",
        "Also fry the cashewnuts till golden brown",
        "Set aside.\r\n\r\nWash the rice and soak in water for twenty minutes.\r\nMeanwhile, take a big wide pan, add oil in medium heat, add the sliced onions, add the blended paste, to it add the green chillies, ginger garlic paste and garlic and fry for a minute.\r\nThen add the tomatoes and sauté them well till they are cooked and not mushy.\r\n\r\nThen to it add the red chilli powder, biryani powder, mint, coriander leaves and sauté them well.\r\nAdd the yogurt and mix well",
        "I always move the skillet away from the heat when adding yogurt which prevents it from curdling.\r\n\r\nNow after returning the skillet back to the stove, add the washed lamb and salt and ½ cup water and mix well",
        "Cook for 1 hour and cook it covered in medium low heat or put it in a pressure cooker for 6 whistles",
        "If the water is not drained totally, heat it by keeping it open.\r\n\r\nTake another big pan, add thrice the cup of rice you use, and boil it",
        "When it is boiling high, add the rice, salt and jeera and mix well",
        "After 7 minutes exact or when the rice is 80% done",
        "Switch off and drain the rice.\r\n\r\nNow, the layering starts",
        "To the lamb, pat and level it",
        "Add the drained hot rice on the top of it",
        "Garnish with fried onions, ghee, mint, coriander leaves and saffron dissolved in milk.\r\n\r\nCover the dish and bake in a 350f oven for 15 minutes or till the cooked but not mushy",
        "Or cook in the stove medium heat for 12 minutes and lowest heat for 5 minutes",
        "And switch off",
        "Mix and serve hot!\r\nNotes\r\n1",
        "If you are cooking in oven, do make sure to cook in a big oven safe pan and cover it tight and then keep in oven for the final step.\r\n2",
        "You can skip biryani masala if you don’t have and add just garam masala (1 tsp and red chilli powder – 3 tsp instead of 1 tsp)\r\n3",
        "If it is spicy in the end, squeeze some lemon, it will reduce the heat and enhance the flavors also."
    ],
    "gulab jam": [
        "Sorry, I couldn’t find a recipe for gulab jam."
    ],
    "tomato": [
        "Put the oil, onions, celery, carrots, potatoes and bay leaves in a big casserole dish, or two saucepans",
        "Fry gently until the onions are softened – about 10-15 mins",
        "Fill the kettle and boil it.\r\nStir in the tomato purée, sugar, vinegar, chopped tomatoes and passata, then crumble in the stock cubes",
        "Add 1 litre boiling water and bring to a simmer",
        "Cover and simmer for 15 mins until the potato is tender, then remove the bay leaves",
        "Purée with a stick blender (or ladle into a blender in batches) until very smooth",
        "Season to taste and add a pinch more sugar if it needs it",
        "The soup can now be cooled and chilled for up to 2 days, or frozen for up to 3 months.\r\nTo serve, reheat the soup, stirring in the milk – try not to let it boil",
        "Serve in small bowls with cheesy sausage rolls."
    ],
    "laddu": [
        "Sorry, I couldn’t find a recipe for laddu."
    ],
    "pasta": [
        "Bring a large saucepan of salted water to the boil\r\nAdd the pasta, stir once and cook for about 10 minutes or as directed on the packet.\r\nMeanwhile, wash the tomatoes and cut into quarters",
        "Slice the olives",
        "Wash the basil.\r\nPut the tomatoes into a salad bowl and tear the basil leaves over them",
        "Add a tablespoon of olive oil and mix.\r\nWhen the pasta is ready, drain into a colander and run cold water over it to cool it quickly.\r\nToss the pasta into the salad bowl with the tomatoes and basil.\r\nAdd the sliced olives, drained mozzarella balls, and chunks of tuna",
        "Mix well and let the salad rest for at least half an hour to allow the flavours to mingle.\r\nSprinkle the pasta with a generous grind of black pepper and drizzle with the remaining olive oil just before serving."
    ]
}